'''
1. 아이디어
- 1,2,3 만으로 해당 숫자를 만드는 방법의 수
- 중복 가능, 순서 상관있음
- 1 => (1)1
- 2 => (2)1+1, 2
- 3 => (4)1+1+1, 2+1, 1+2, 3
- 4 => (7)1+1+1+1, 2+1+1, 1+2+1, 3+1 / 1+1+2, 2+2, 1+3
- 5 => (13)1+1+1+1+1, 2+1+1+1, 1+2+1+1, 1+1+2+1, 2+2+1, 3+1+1, 1+3+1,(7) 
        / 1+1+1+2, 1+1+3, 2+1+2, 1+2+2, 2+3, 3+2 (6)

2. 시간복잡도

3. 자료구조
'''
import sys
input = sys.stdin.readline

N = int(input())

def dps(n):
    dp = [0] * (11)
    dp[1], dp[2], dp[3] = 1, 2, 4

    if n <= 3:
        return dp[n]

    for i in range(4, n+1):
        dp[i] = dp[i-1] + dp[i-2] + dp[i-3]
    return dp[n]

for _ in range(N):
    print(dps(int(input())))

